
# Ввод целевой функции
# -----------------------------------------------------------------------------
xn = int(input("Введите, сколько Вы хотите, чтобы было параметров (xn): "))

# L - это целевая функция
L = list()

print("Введите коэффициенты целевой функции (cn):")
for i in range(xn):
    L.append(float(input("x[" + str(i+1) + "]: ")))

# Стремление max/min
aspiration = input("Введите, что вы хотите искать (max/min): ")

# Проверка на работоспособность
# for i in range(xn):
    # print(L[i])

# print(aspiration)

# -----------------------------------------------------------------------------

# Ввод ограничений

# -----------------------------------------------------------------------------
# Кол-во ограничений
n = int(input("Введите, сколько уравний, ограничивающих L, Вы хотите: "))

# Создаём словарь
limit_dict = dict()

# Знаки для ограничений
znak = list()

# Правая часть уравнений
value = list()

# Заполняем сами ограничения
for i in range(n):
    print("Введите коэффициенты для " + str(i+1) + " ограничения (am"+ str(i+1) +"):")
    limit_n = list()
    for j in range(xn):
        limit_n.append(float(input("x[" + str(j+1) + "]: ")))
    znak.append(input("Введите знак для " + str(i+1) + " ограничения (am"+ str(i+1) +"): "))
    value.append(float(input("Введите значение после знака: ")))
    limit_dict[i+1] = limit_n

# Проверка на работоспособность
# print(limit_dict)

# -----------------------------------------------------------------------------
